tangyangguang/Esp32_Irrigation/src/web/IrrigationWeb.cpp
#include "web/IrrigationWeb.h"

#include <Arduino.h>
#include <Esp32Base.h>
#include <stdlib.h>
#include <string.h>

#include "domain/BusinessEventLog.h"
#include "domain/FlowCalibration.h"
#include "domain/FlowMeter.h"
#include "domain/ZoneManager.h"
#include "storage/FlowAlertStore.h"
#include "storage/FlowConfigStore.h"
#include "storage/PlanStore.h"
#include "storage/RecordStore.h"
#include "storage/SystemConfigStore.h"
#include "storage/ZoneConfigStore.h"

namespace {

void writeUInt(uint32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%lu", static_cast<unsigned long>(value));
    Esp32BaseWeb::sendChunk(text);
}

void writeInt(int32_t value) {
    char text[16];
    snprintf(text, sizeof(text), "%ld", static_cast<long>(value));
    Esp32BaseWeb::sendChunk(text);
}

void writeBool(bool value) {
    Esp32BaseWeb::sendChunk(value ? "true" : "false");
}

void sendError(int code, const char* error) {
    Esp32BaseWeb::beginResponse(code, "application/json", nullptr);
    Esp32BaseWeb::sendChunk("{\"ok\":false,\"error\":\"");
    Esp32BaseWeb::writeJsonEscaped(error ? error : "error");
    Esp32BaseWeb::sendChunk("\"}");
    Esp32BaseWeb::endResponse();
}

void sendOk() {
    Esp32BaseWeb::sendJson(200, "{\"ok\":true}");
}

bool getParamText(const char* name, char* out, size_t len) {
    return out && len > 0 && Esp32BaseWeb::getParam(name, out, len);
}

bool redirectRequested(char* out, size_t len) {
    if (!getParamText("redirect", out, len)) {
        return false;
    }
    return strncmp(out, "/irrigation", 11) == 0;
}

void sendOkOrRedirect() {
    char redirect[80];
    if (redirectRequested(redirect, sizeof(redirect))) {
        Esp32BaseWeb::redirectSeeOther(redirect);
        return;
    }
    sendOk();
}

bool readU32(const char* name, uint32_t* out) {
    char text[24];
    if (!out || !getParamText(name, text, sizeof(text)) || text[0] == '\0') {
        return false;
    }
    char* end = nullptr;
    const unsigned long value = strtoul(text, &end, 10);
    if (!end || *end != '\0') {
        return false;
    }
    *out = static_cast<uint32_t>(value);
    return true;
}

bool readI32(const char* name, int32_t* out) {
    char text[24];
    if (!out || !getParamText(name, text, sizeof(text)) || text[0] == '\0') {
        return false;
    }
    char* end = nullptr;
    const long value = strtol(text, &end, 10);
    if (!end || *end != '\0') {
        return false;
    }
    *out = static_cast<int32_t>(value);
    return true;
}

bool readU8(const char* name, uint8_t* out) {
    uint32_t value = 0;
    if (!out || !readU32(name, &value) || value > 255) {
        return false;
    }
    *out = static_cast<uint8_t>(value);
    return true;
}

bool readU16(const char* name, uint16_t* out) {
    uint32_t value = 0;
    if (!out || !readU32(name, &value) || value > 65535UL) {
        return false;
    }
    *out = static_cast<uint16_t>(value);
    return true;
}

bool readCheckbox(const char* name) {
    char value[8];
    if (!getParamText(name, value, sizeof(value))) {
        return false;
    }
    return strcmp(value, "1") == 0 || strcmp(value, "true") == 0 || strcmp(value, "on") == 0;
}

bool readZoneId(uint8_t* zoneId) {
    return readU8("zoneId", zoneId) && Irrigation::validZoneId(*zoneId);
}

bool readFlowId(uint8_t* flowId) {
    return readU8("flowId", flowId) && *flowId >= 1 && *flowId <= Irrigation::MaxFlowMeters;
}

bool flowHasEnabledZones(uint8_t flowId) {
    for (uint8_t zoneId = 1; zoneId <= Irrigation::MaxZones; ++zoneId) {
        const Irrigation::ZoneConfig& zone = ZoneConfigStore::get(zoneId);
        if (zone.enabled && zone.flowId == flowId) {
            return true;
        }
    }
    return false;
}

void writeBaselineJson(const Irrigation::ZoneFlowBaselineProfile& baseline) {
    Esp32BaseWeb::sendChunk("{\"source\":");
    writeUInt(static_cast<uint8_t>(baseline.source));
    Esp32BaseWeb::sendChunk(",\"learnedFlowMlPerMin\":");
    writeUInt(baseline.learnedFlowMlPerMin);
    Esp32BaseWeb::sendChunk(",\"lowFlowPermille\":");
    writeUInt(baseline.lowFlowPermille);
    Esp32BaseWeb::sendChunk(",\"highFlowPermille\":");
    writeUInt(baseline.highFlowPermille);
    Esp32BaseWeb::sendChunk(",\"flowFaultConfirmSec\":");
    writeUInt(baseline.flowFaultConfirmSec);
    Esp32BaseWeb::sendChunk(",\"lowFlowAction\":");
    writeUInt(static_cast<uint8_t>(baseline.lowFlowAction));
    Esp32BaseWeb::sendChunk(",\"highFlowAction\":");
    writeUInt(static_cast<uint8_t>(baseline.highFlowAction));
    Esp32BaseWeb::sendChunk(",\"noPulseTimeoutSec\":");
    writeUInt(baseline.noPulseTimeoutSec);
    Esp32BaseWeb::sendChunk("}");
}

void writeCalibrationJson(const Irrigation::FlowMeterCalibrationProfile& profile) {
    Esp32BaseWeb::sendChunk("{\"source\":");
    writeUInt(static_cast<uint8_t>(profile.source));
    Esp32BaseWeb::sendChunk(",\"kUlPerMinPerHz\":");
    writeInt(profile.kUlPerMinPerHz);
    Esp32BaseWeb::sendChunk(",\"offsetMilliHz\":");
    writeInt(profile.offsetMilliHz);
    Esp32BaseWeb::sendChunk(",\"warningFreqMilliHz\":");
    writeUInt(profile.warningFreqMilliHz);
    Esp32BaseWeb::sendChunk(",\"minValidFreqMilliHz\":");
    writeUInt(profile.minValidFreqMilliHz);
    Esp32BaseWeb::sendChunk(",\"maxValidFreqMilliHz\":");
    writeUInt(profile.maxValidFreqMilliHz);
    Esp32BaseWeb::sendChunk(",\"pressurizeSec\":");
    writeUInt(profile.pressurizeSec);
    Esp32BaseWeb::sendChunk(",\"sampleWindowSec\":");
    writeUInt(profile.sampleWindowSec);
    Esp32BaseWeb::sendChunk("}");
}

void writeZoneConfigJson(const Irrigation::ZoneConfig& config) {
    Esp32BaseWeb::sendChunk("{\"zoneId\":");
    writeUInt(config.zoneId);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(config.name);
    Esp32BaseWeb::sendChunk("\",\"valvePin\":");
    writeUInt(config.valvePin);
    Esp32BaseWeb::sendChunk(",\"flowId\":");
    writeUInt(config.flowId);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    writeBool(config.enabled);
    Esp32BaseWeb::sendChunk(",\"hasLearnedBaseline\":");
    writeBool(config.hasLearnedBaseline);
    Esp32BaseWeb::sendChunk(",\"activeBaseline\":");
    writeBaselineJson(config.activeBaseline);
    Esp32BaseWeb::sendChunk(",\"hasPendingBaseline\":");
    writeBool(config.hasPendingBaseline);
    if (config.hasPendingBaseline) {
        Esp32BaseWeb::sendChunk(",\"pendingBaseline\":");
        writeBaselineJson(config.pendingBaseline);
    }
    Esp32BaseWeb::sendChunk(",\"hasRollbackBaseline\":");
    writeBool(config.hasRollbackBaseline);
    Esp32BaseWeb::sendChunk("}");
}

void writeFlowConfigJson(const Irrigation::FlowMeterConfig& config) {
    Esp32BaseWeb::sendChunk("{\"flowId\":");
    writeUInt(config.flowId);
    Esp32BaseWeb::sendChunk(",\"pulsePin\":");
    writeUInt(config.pulsePin);
    Esp32BaseWeb::sendChunk(",\"enabled\":");
    writeBool(config.enabled);
    Esp32BaseWeb::sendChunk(",\"activeCalibration\":");
    writeCalibrationJson(config.activeCalibration);
    Esp32BaseWeb::sendChunk(",\"hasPendingCalibration\":");
    writeBool(config.hasPendingCalibration);
    Esp32BaseWeb::sendChunk(",\"hasRollbackCalibration\":");
    writeBool(config.hasRollbackCalibration);
    Esp32BaseWeb::sendChunk("}");
}

void writePlanJson(const Irrigation::PlanDefinition& plan) {
    Esp32BaseWeb::sendChunk("{\"exists\":");
    writeBool(plan.exists);
    Esp32BaseWeb::sendChunk(",\"planId\":");
    writeUInt(plan.planId);
    Esp32BaseWeb::sendChunk(",\"zoneId\":");
    writeUInt(plan.zoneId);
    Esp32BaseWeb::sendChunk(",\"slotIndex\":");
    writeUInt(plan.slotIndex);
    Esp32BaseWeb::sendChunk(",\"name\":\"");
    Esp32BaseWeb::writeJsonEscaped(plan.name);
    Esp32BaseWeb::sendChunk("\",\"enabled\":");
    writeBool(plan.enabled);
    Esp32BaseWeb::sendChunk(",\"timeHour\":");
    writeUInt(plan.timeHour);
    Esp32BaseWeb::sendChunk(",\"timeMinute\":");
    writeUInt(plan.timeMinute);
    Esp32BaseWeb::sendChunk(",\"durationSec\":");
    writeUInt(plan.durationSec);
    Esp32BaseWeb::sendChunk(",\"cycleDays\":");
    writeUInt(plan.cycleDays);
    Esp32BaseWeb::sendChunk(",\"cycleMask\":");
    writeUInt(plan.cycleMask);
    Esp32BaseWeb::sendChunk(",\"cycleStartYmd\":");
    writeUInt(plan.cycleStartYmd);
    Esp32BaseWeb::sendChunk("}");
}

